Autodesk.Navisworks.Api.Plugins.ToolPlugin
A plugin that provides the behaviour of a custom tool.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.#ctor
Default constructor for an ToolPlugin

Autodesk.Navisworks.Api.Plugins.ToolPlugin.ContextMenu(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
ContextMenu handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.GetCursor(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers)
GetCursor handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.GetHelpIdAtPoint(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
GetHelpIdAtPoint handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.GetHelpIdForHighlight(Autodesk.Navisworks.Api.View)
GetHelpIdForHighlight handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.GetTooltip(Autodesk.Navisworks.Api.View,System.Int32,System.Int32)
GetTooltip handler

Autodesk.Navisworks.Api.Plugins.ToolPlugin.KeyDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Double)
MouseLeave handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.KeyDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
KeyDrag  handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.KeyUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Double)
KeyUp handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MakeRenderBoundingBox(Autodesk.Navisworks.Api.View)
Should return bounding box of any additional model space geometry that will be rendered so that near/far clipping planes can be adjusted accordingly.
Returns:
Bounding box

Autodesk.Navisworks.Api.Plugins.ToolPlugin.ModifierKeyDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
ModifierKeyDown handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.ModifierKeyUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Double)
ModifierKeyUp handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MouseDown(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Int32,System.Int32,System.Double)
Mouse down handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MouseDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.Double)
Mouse drag handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MouseLeave(Autodesk.Navisworks.Api.View,System.Double)
Mouse leave handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MouseMove(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.Double)
Mouse move handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.MouseUp(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.UInt16,System.Int32,System.Int32,System.Double)
Mouse up handler.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.OverlayRender(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing overlayed on main render.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.Render(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing in main render.

Autodesk.Navisworks.Api.Plugins.ToolPlugin.WheelDrag(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.KeyModifiers,System.Int32,System.Int32,System.UInt16,System.Double,System.Double)
WheelDrag handler.